tutorials/viscoelasticFluidFoam/FENE-CR/constant/viscoelasticProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          viscoelasticProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


rheology
{

        type multiMode;

        models
        (

                first
                {
                type FENE-CR;
                rho              rho [1 -3 0 0 0 0 0] 875.96;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.007;
                etaP             etaP [1 -1 -1 0 0 0 0] 11.356;
                lambda           lambda [0 0 1 0 0 0 0] 0.35;
                L2               L2 [0 0 0 0 0 0 0] 25;
                }

        );

} 



// ************************************************************************* //
