tutorials/viscoelasticFluidFoam/FENE-CR/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "FENE-CR";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    patch3
    {
        type            zeroGradient;

    }
    patch2
    {
        type            fixedValue;
        value           uniform 0;
    }
    patch1
    {
        type            zeroGradient;
    }

    patch0
    {
        type            empty;
    }

}


// ************************************************************************* //
